{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"config": {"batch_input_shape": [null, 64, 64, 1], "dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 32, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_12", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_5", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_13", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_6", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_14", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_7", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "activation": "linear", "name": "conv2d_8", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 64, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_15", "trainable": true}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_8", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "name": "dense_9", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_16", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_10", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_17", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_11", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_18", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_12", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_19", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_13", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_20", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_14", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_21", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "name": "dense_15", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_22", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "softmax", "name": "dense_16", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}